CSI API ETABS v1
cDetailing Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDetailing
Public Interface cDetailing
Dim instance As cDetailing
public interface class cDetailing
type cDetailing =  interface end
The cDetailing type exposes the following members.
Methods
Name | Description
ClearDetailing
GetBeamLongRebarData
 Retrieves longitudinal rebar data for a beam frame object
GetBeamTieRebarData
 Retrieves tie (confinement/shear) rebar data for a beam frame object
GetColumnLongRebarData
 Retrieves longitudinal rebar data for a column frame object
GetColumnTieRebarData
 Retrieves tie (confinement/shear) rebar data for a column frame object
GetDetailed_OneWallStack
 Detailed output for Wall
GetDetailedBeamLineData
GetDetailedBeamLineData_1
GetDetailedBeamLineData_2
GetDetailedBeamLineGuidData
GetDetailedBeamLines
GetDetailedBeamLines_1
GetDetailedColumnStackData
GetDetailedColumnStackData_1
GetDetailedColumnStackData_2
GetDetailedColumnStackGuidData
GetDetailedColumnStacks
GetDetailedSlab_OneDetailingOutputInfo
 Detailing output of one slab on a particular floor
GetDetailedSlabBotBarData
GetDetailedSlabBotBarData_1
GetDetailedSlabs
GetDetailedSlabTopBarData
GetDetailedSlabTopBarData_1
GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint
 Polyline(s) of the Bar shapes, in Local Design Leg Coordinates
GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBar_OneTiePlineInfo
 Polyline(s) of the Bar shapes, in Local Design Leg Coordinates
GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo
 Represents one Rebar Tie/Stirrup set in a Design Leg, in local axis
GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo
 Defines one set of Vertical bars, along local X axis of the Design Leg. Each data set represents one group of bars, placed along a line, with refrence to Design Leg centerline
GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo
 Represents Rebars in one Design Leg, on one story as defined in ETABS
GetDetailedWall_OneWallStack_OnePierOutputInfo
 Represents a Pier in the wall stack, for one story. Contains the Design Legs from one or more ETABS PierSectons/WallSections
GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo
 Represents Rebars in one Spandrel on a particular story , as defined in ETABS
GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo
 Represents Rebars in one Spandrel on a particular story , as defined in ETABS
GetDetailedWall_OneWallStack_OneSpandrelOutputInfo
 Represents Rebars in one Spandrel on a particular story , as defined in ETABS
GetDetailingAvailable
GetNumberDetailedSlabs
 Retrieves number of Detailed outputs for Slab
GetNumberDetailedWallStacks
 Retrieves number of Detailed outputs for Wall
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar1Info
 Represents one Bar in extent - BOTTOM BAR1
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info
 Represents one Bar in extent - BOTTOM BAR2
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebarInfo
 Represents one Bar in extent - BOTTOM BARS
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebar_Bar1Info
 Represents one Bar in extent - TOP BAR1
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebar_Bar2Info
 Represents one Bar in extent - TOP BAR2
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo
 Represents one Bar in extent - TOP BARS
GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo
 Represents one region of Design Strip, based on strip segment and slab geometry
GetOneDetailedSlab_OneDetailingOutput_StripGUID
 Represents the detailed rebars in one rebar strip of the slab, as defined in ETABS
GetOneDetailedSlab_OneDetailingOutput_StripInfo
 Represents the detailed rebars in one rebar strip of the slab, as defined in ETABS
GetSimilarBeamLines
GetSimilarBeamLines_1
GetSimilarColumnStacks
GetSimilarSlabs
StartDetailing
Top
See Also
Reference
ETABSv1 Namespace